/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   philo_thread.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: swang <swang@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/28 16:31:36 by swang             #+#    #+#             */
/*   Updated: 2021/10/28 16:47:57 by swang            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../include/philo.h"

void	philo_thread(void *param)
{
	t_philo *philo;

	philo = (t_philo *)param;
	//홀수 쓰레드 짝수 쓰레드를 어떻게 구분하지? 필로소퍼 이름,,,(1번필로는 사실 짝수번째 철학자이다)
	if (philo.name % 2 == 0) //이름이 짝수인사람은 기다려
		usleep(100);//얼마나 기다리지?
	while (philo.data->death_check == 0) // 죽은사람이 아무도 없을 때
	{

	/*
	왼쪽포크
	오른쪽포크
	먹고
	왼쪽포크
	오른쪽포크
	자고
	생각-
	*/





	}

}
